# Marketing Attribution, ( identity graph )

In [1]:
import pandas as pd
import numpy as np

I'll count how many identities we have in a sets of related tables: example 1 and example 2

In [2]:
# Create all tables for further merging (table 'crm')
crm = pd.DataFrame(
    {
        'client_id': [1, 2],
        'email': ['a@a.a', 'b@b.b'],
        'payment_account_id': [1, 2]
    }
)
crm

   client_id  email  payment_account_id
0          1  a@a.a                   1
1          2  b@b.b                   2

In [3]:
# Create all tables for further merging (table 'orders')
orders = pd.DataFrame(
    {
        'order_id': [1, 2],
        'payment_account_id': [1, 2],
        'device_id': [1, 3]
    }
    )
orders

   order_id  payment_account_id  device_id
0         1                   1          1
1         2                   2          3

In [4]:
# Create all tables for further merging (table 'sessions')
sessions = pd.DataFrame(
    {
        'session_id': [1, 1, 2, 2, 3, 3],
        'email': ['a@a.a', '', '', '', 'b@b.b', ''],
        'device_id': [1, 1, 2, 2, '', 3]
    }
)
sessions

   session_id  email device_id
0           1  a@a.a         1
1           1                1
2           2                2
3           2                2
4           3  b@b.b
5           3                3

In [5]:
# Create all tables for further merging (table 'opened_emails_stats')
opened_emails_stats = pd.DataFrame(
    {
        'email': ['a@a.a', 'a@a.a', 'b@b.b', ''],
        'order_id': ['', '', '', 2],
        'device_id': [1, 4, 1, 2]
    }
)
opened_emails_stats

   email order_id  device_id
0  a@a.a                   1
1  a@a.a                   4
2  b@b.b                   1
3               2          2

In [9]:
# Merging the table 'crm' and 'orders'. 
results = crm.merge(orders, on = 'payment_account_id')
results

   client_id  email  payment_account_id  order_id  device_id
0          1  a@a.a                   1         1          1
1          2  b@b.b                   2         2          3

In [11]:
# Merging the table 'results' and 'sessions'.
results = results.merge(sessions, on = ['device_id','email'])
results

,client_id,email,payment_account_id,order_id,device_id,session_id_x,session_id_y
0,1,a@a.a,1,1,1,1,1

In [12]:
# Merging the table 'results' and 'opened_emails_stats'.
# We have only one identity in example 1.
results = results.merge(opened_emails_stats, on = ['device_id','email'])
results

,client_id,email,payment_account_id,order_id_x,device_id,session_id_x,session_id_y,order_id_y
0,1,a@a.a,1,1,1,1,1,

Now we'll count how many identity in example 2.

In [24]:
# Create first table for further merging (table 'table_1')
table_1 = pd.DataFrame(
    {
        'id_1': [1111, 'null', 1111, 1112, 'null'],
        'id_2': [2222, 2222, 'null', 2223, 'null'],
        'id_3': [3333, 3334, 3335, 'null', 3334]
    }
)
table_1

   id_1  id_2  id_3
0  1111  2222  3333
1  null  2222  3334
2  1111  null  3335
3  1112  2223  null
4  null  null  3334

In [26]:
# Create second table for further merging (table 'table_2')
table_2 = pd.DataFrame(
    {
        'id_4': [444, 445, 'null'],
        'id_2': [2222, 'null', 2223],
        'id_3': [3335, 3334, 3334]
    }
)
table_2

   id_4  id_2  id_3
0   444  2222  3335
1   445  null  3334
2  null  2223  3334

In [27]:
# Merging the table 'table_1' and 'table_2'.
# We have only one identity in example 2 as well.
identities_example_2 = table_1.merge(table_2, on = ['id_2', 'id_3'])
identities_example_2

   id_1  id_2  id_3 id_4
0  null  null  3334  445

Conclusions: in example 1 we have one identity and in example 2 we have one identity as well.